In [3]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
sns.set(style="whitegrid")
np.random.seed(203)
from tqdm import tqdm
import datetime
from itertools import combinations
from collections import Counter
import itertools
import re

from sklearn.model_selection import train_test_split 
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report, accuracy_score
from sklearn.manifold import TSNE
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
from sklearn.decomposition import PCA
from sklearn.model_selection import KFold, StratifiedKFold
from sklearn.preprocessing import Binarizer
from sklearn.ensemble import RandomForestClassifier

from sklearn.metrics import precision_score , recall_score , f1_score
import lightgbm as lgb
from scipy import stats
from scipy.spatial.distance import mahalanobis

#### Train_Data

In [134]:
campaign_data = pd.read_csv('/Users/s0c02nj/Desktop/AmExpert/train_AUpWtIz/campaign_data.csv')
coupon_item_mapping = pd.read_csv('/Users/s0c02nj/Desktop/AmExpert/train_AUpWtIz/coupon_item_mapping.csv')
customer_demographics = pd.read_csv('/Users/s0c02nj/Desktop/AmExpert/train_AUpWtIz/customer_demographics.csv')
customer_transaction_data = pd.read_csv('/Users/s0c02nj/Desktop/AmExpert/train_AUpWtIz/customer_transaction_data.csv')
item_data = pd.read_csv('/Users/s0c02nj/Desktop/AmExpert/train_AUpWtIz/item_data.csv')
train = pd.read_csv('/Users/s0c02nj/Desktop/AmExpert/train_AUpWtIz/train.csv')

#### Test_Data

In [127]:
test = pd.read_csv('/Users/s0c02nj/Desktop/AmExpert/test_QyjYwdj.csv')

In [128]:
train.head()

   id  campaign_id  coupon_id  customer_id  redemption_status
0   1           13         27         1053                  0
1   2           13        116           48                  0
2   6            9        635          205                  0
3   7           13        644         1050                  0
4   9            8       1017         1489                  0

#### Campaign Data

In [135]:
campaign_data.head()

   campaign_id campaign_type start_date  end_date
0           24             Y   21/10/13  20/12/13
1           25             Y   21/10/13  22/11/13
2           20             Y   07/09/13  16/11/13
3           23             Y   08/10/13  15/11/13
4           21             Y   16/09/13  18/10/13

In [143]:
campaign_data[campaign_data['duration']<0]

,campaign_id,campaign_type,start_date,end_date,strt_wk,strt_mnth,strt_day,end_wk,end_mnth,end_day,duration
6,18,X,2013-10-08,2013-04-10,41,10,8,15,4,10,-181
10,13,X,2013-05-19,2013-05-07,20,5,19,19,5,7,-12
17,6,Y,2013-01-28,2013-01-03,5,1,28,1,1,3,-25
19,5,Y,2013-12-01,2013-02-15,48,12,1,7,2,15,-289
27,26,X,2012-12-08,2012-09-21,49,12,8,38,9,21,-78

In [140]:
campaign_data['start_date'] = pd.to_datetime(campaign_data['start_date'],infer_datetime_format=True)
campaign_data['end_date'] = pd.to_datetime(campaign_data['end_date'],infer_datetime_format=True)

In [141]:
campaign_data['strt_wk'] = campaign_data['start_date'].dt.week
campaign_data['strt_mnth'] = campaign_data['start_date'].dt.month
campaign_data['strt_day'] = campaign_data['start_date'].dt.day

campaign_data['end_wk'] = campaign_data['end_date'].dt.week
campaign_data['end_mnth'] = campaign_data['end_date'].dt.month
campaign_data['end_day'] = campaign_data['end_date'].dt.day

campaign_data['duration'] = campaign_data['end_date'] - campaign_data['start_date']
campaign_data['duration'] = campaign_data['duration'].apply(lambda x: x.days)

In [123]:
campaign_data = campaign_data.drop(['start_date','end_date'],axis=1)

In [71]:
item_data.head()

   item_id  brand   brand_type       category
0        1      1  Established        Grocery
1        2      1  Established  Miscellaneous
2        3     56        Local         Bakery
3        4     56        Local        Grocery
4        5     56        Local        Grocery

In [49]:
customer_demographics.head()

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,70+,Married,0,2,NaN,4
1,6,46-55,Married,0,2,NaN,5
2,7,26-35,NaN,0,3,1,3
3,8,26-35,NaN,0,4,2,6
4,10,46-55,Single,0,1,NaN,5

In [50]:
customer_transaction_data.head()

,date,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount
0,2012-01-02,1501,26830,1,35.26,-10.69,0.0
1,2012-01-02,1501,54253,1,53.43,-13.89,0.0
2,2012-01-02,1501,31962,1,106.50,-14.25,0.0
3,2012-01-02,1501,33647,1,67.32,0.00,0.0
4,2012-01-02,1501,48199,1,71.24,-28.14,0.0

#### Baseline Model

In [70]:
train.head()

   id  campaign_id  coupon_id  customer_id  redemption_status
0   1           13         27         1053                  0
1   2           13        116           48                  0
2   6            9        635          205                  0
3   7           13        644         1050                  0
4   9            8       1017         1489                  0

In [81]:
y = train['redemption_status']
train_x = train.drop(['redemption_status'],axis=1)
test_x = test

df_join = pd.concat([train_x,test_x])

In [83]:
df1 = pd.merge(left = df_join, right = customer_demographics, 
               how='left', left_on=['customer_id'], right_on=['customer_id'])

In [86]:
df1.head()

,id,campaign_id,coupon_id,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,13,27,1053,46-55,NaN,0.0,1,NaN,5.0
1,2,13,116,48,36-45,Married,0.0,2,NaN,3.0
2,6,9,635,205,46-55,Married,0.0,2,NaN,7.0
3,7,13,644,1050,NaN,NaN,NaN,NaN,NaN,NaN
4,9,8,1017,1489,46-55,Married,0.0,2,NaN,3.0

In [110]:
df2 = pd.merge(left = df1, right = campaign_data, 
                     how='left', left_on=['campaign_id'], right_on=['campaign_id'])

In [111]:
df2.head()

,id,campaign_id,coupon_id,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket,campaign_type,strt_wk,strt_mnth,strt_day,end_wk,end_mnth,end_day,duration
0,1,13,27,1053,46-55,NaN,0.0,1,NaN,5.0,X,20,5,19,19,5,7,-12
1,2,13,116,48,36-45,Married,0.0,2,NaN,3.0,X,20,5,19,19,5,7,-12
2,6,9,635,205,46-55,Married,0.0,2,NaN,7.0,Y,44,11,3,49,12,4,31
3,7,13,644,1050,NaN,NaN,NaN,NaN,NaN,NaN,X,20,5,19,19,5,7,-12
4,9,8,1017,1489,46-55,Married,0.0,2,NaN,3.0,X,7,2,16,18,5,4,77

In [68]:
customer_transaction_data[customer_transaction_data['customer_id'] == 1501]

,date,customer_id,item_id,quantity,selling_price,other_discount,coupon_discount
0,2012-01-02,1501,26830,1,35.26,-10.69,0.00
1,2012-01-02,1501,54253,1,53.43,-13.89,0.00
2,2012-01-02,1501,31962,1,106.50,-14.25,0.00
3,2012-01-02,1501,33647,1,67.32,0.00,0.00
4,2012-01-02,1501,48199,1,71.24,-28.14,0.00
5,2012-01-02,1501,57397,1,71.24,-28.14,0.00
2732,2012-01-13,1501,5267,1,99.38,0.00,0.00
2733,2012-01-13,1501,8420,1,70.88,-21.37,0.00
2734,2012-01-13,1501,8761,1,149.25,0.00,0.00
2735,2012-01-13,1501,11248,1,338.03,0.00,0.00
2736,2012-01-13,1501,15610,1,427.08,0.00,0.00
2737,2012-01-13,1501,15967,2,213.72,-70.53,0.00
2738,2012-01-13,1501,16810,1,70.88,-21.37,0.00
2739,2012-01-13,1501,18084,1,89.05,-53.07,0.00
2740,2012-01-13,1501,18681,1,284.60,0.00,0.00
2741,2012-01-13,1501,21170,2,70.53,-49.87,0.00
2742,2012-01-13,1501,21177,1,149.25,0.00,0.00
2743,2012-01-13,1501,22559,2,142.48,-34.91,0.00
2744,2012-01-13,1501,24694,1,89.05,-53.07,0.00
2745,2012-01-13,1501,26854,1,31.35,-25.29,0.00
2746,2012-01-13,1501,27689,2,70.88,-70.88,0.00
2747,2012-01-13,1501,27979,1,131.44,0.00,0.00
2748,2012-01-13,1501,30243,1,85.13,0.00,0.00
2749,2012-01-13,1501,30584,2,438.48,0.00,0.00
2750,2012-01-13,1501,31248,2,153.88,-73.38,0.00
2751,2012-01-13,1501,32104,1,177.74,-53.43,0.00
2752,2012-01-13,1501,32635,1,45.24,0.00,0.00
2753,2012-01-13,1501,35492,1,159.93,-35.62,0.00
2754,2012-01-13,1501,45209,1,97.96,-19.23,0.00
2755,2012-01-13,1501,45520,1,97.96,-19.23,0.00
...,...,...,...,...,...,...,...
1268476,2013-06-13,1501,57975,1,44.52,-35.26,-26.71
1268477,2013-06-13,1501,59005,1,131.44,-10.69,0.00
1268478,2013-06-13,1501,63249,1,59.13,-33.13,0.00
1268479,2013-06-13,1501,64104,2,134.64,-7.12,0.00
1268480,2013-06-13,1501,64142,3,234.02,0.00,0.00
1268481,2013-06-13,1501,65928,1,59.49,-10.33,0.00
1268482,2013-06-13,1501,65941,1,59.49,-10.33,0.00
1268483,2013-06-13,1501,65976,1,59.13,-10.69,-35.62
1268484,2013-06-13,1501,69058,1,117.19,-3.56,0.00
1268485,2013-06-13,1501,69244,1,81.57,0.00,0.00
1268486,2013-06-13,1501,70347,1,131.44,-10.69,-35.62
1268487,2013-06-13,1501,70347,1,131.44,-10.69,-35.62
1268488,2013-06-13,1501,71542,2,178.10,-27.78,-35.62
1268489,2013-06-13,1501,72783,1,58.77,-35.26,-12.47
1268490,2013-06-13,1501,72790,1,106.86,-17.45,0.00
1268491,2013-06-13,1501,72820,1,106.86,-17.45,0.00
1268492,2013-06-13,1501,73094,2,319.87,0.00,0.00
1268493,2013-06-13,1501,73251,1,93.32,0.00,-35.62
1268494,2013-06-13,1501,73580,1,95.82,0.00,0.00
1268495,2013-06-13,1501,73748,2,142.48,-70.53,-71.24
1278294,2013-06-16,1501,13467,1,95.82,-5.34,0.00
1278295,2013-06-16,1501,34047,1,82.64,0.00,0.00
1299634,2013-06-25,1501,13467,1,95.82,-5.34,0.00
1299635,2013-06-25,1501,20415,1,70.88,0.00,0.00
1299636,2013-06-25,1501,53304,1,106.50,0.00,0.00
1312626,2013-06-29,1501,61261,1,76.94,0.00,0.00
1320415,2013-07-02,1501,10044,2,134.64,-128.23,0.00
1320416,2013-07-02,1501,13467,1,95.82,-5.34,0.00
1320417,2013-07-02,1501,26854,1,35.62,-21.02,0.00
1320418,2013-07-02,1501,34047,1,82.64,0.00,0.00

In [56]:
train['campaign_id'].unique().shape

(18,)

In [55]:
test['campaign_id'].unique().shape

(10,)